function l_mark=inverse_solution(x)

tx=x(1);ty=x(2);tz=x(3);                                    %输入末端点在静坐标系x,y,z轴上的坐标
%##########################################################################################
%程序说明:
%本matlab程序用于计算杆长数据，阅读程序需结合并联平台计算文档
%输入为末端点坐标值，输出为六驱动杆杆长，参数修改请跳转到并联平台尺寸赋值程序段
%2019年11月6日 古锐
%#########################################################################################
%-----------------------------------------------------------------------------------------
% 仿真函数说明:
% 该函数为末端点绕圆锥面的螺旋复合运动,默认圆锥角大小40度
% tz=h+l+time;(time是时间)                                  %末端点Z轴方向坐标
% tx=(tz-h-l)*tan(20*pi/180)*cos((tz-h-l)*2*pi);            %末端点X轴方向坐标
% ty=(tz-h-l)*tan(20*pi/180)*sin((tz-h-l)*2*pi);            %末端点Y轴方向坐标
%------------------------------------------------------------------------------------------
%-----------------------------------------------------------------------------------------
%程序段说明：
%此处为并联平台相关尺寸赋值
rs=70;                                                      %静平台铰接点分布圆半径
rm=40;                                                      %动平台铰接点分布圆半径
alpha=32*pi/180;                                            %静平台临近铰接点对应圆心角
beta=44*pi/180;                                             %静平台临近铰接点对应圆心角
h=300;                                                      %动静平台垂直间距
lh=100;                                                     %初始时,器械末端至远心点距离(参见计算文档第一节,此时远心点和器械上的F1重合)
l=350;                                                      %lh为末端到杆上最远远心点距离，lj为远心点在杆上的移动距离
fix=[0,0,h+l-lh];                                           %初始时平台摆正,远心点在静坐标系下的坐标
%-----------------------------------------------------------------------------------------
%% ----------------------------------------------------------------------------------------
%程序段说明:
%计算动铰接点在动坐标系下的坐标(用m表示)，静铰接点在静坐标系下的坐标(用s表示)
%变量后的数字表示序号，和动静平台的对应关系参见计算文档图一（a）（c）
%注：此处为齐次坐标，如mm1向量的前三位分别表示x,y,z的坐标值，第四位为固定值1便于坐标转换
mm1=[rm*cos(2*pi/3-beta/2),rm*sin(2*pi/3-beta/2),0,1];
mm2=[rm*cos(2*pi/3+beta/2),rm*sin(2*pi/3+beta/2),0,1];
mm3=[rm*cos(4*pi/3-beta/2),rm*sin(4*pi/3-beta/2),0,1];
mm4=[rm*cos(4*pi/3+beta/2),rm*sin(4*pi/3+beta/2),0,1];
mm5=[rm*cos(-beta/2),rm*sin(-beta/2),0,1];
mm6=[rm*cos(beta/2),rm*sin(beta/2),0,1];
ss1=[rs*cos(pi/3+alpha/2),rs*sin(pi/3+alpha/2),0,1];
ss2=[rs*cos(pi-alpha/2),rs*sin(pi-alpha/2),0,1];
ss3=[rs*cos(pi+alpha/2),rs*sin(pi+alpha/2),0,1];
ss4=[rs*cos(5*pi/3-alpha/2),rs*sin(5*pi/3-alpha/2),0,1];
ss5=[rs*cos(5*pi/3+alpha/2),rs*sin(5*pi/3+alpha/2),0,1];
ss6=[rs*cos(pi/3-alpha/2),rs*sin(pi/3-alpha/2),0,1];
mm=[mm1;mm2;mm3;mm4;mm5;mm6];                                %存储动铰接点在动坐标系下的坐标
ss=[ss1;ss2;ss3;ss4;ss5;ss6];                                %存储静铰接点在静坐标系下的坐标
%% ---------------------------------------------------------------------------------------
l_mark=comput(ss,mm,fix,l,tx,ty,tz);                         %调用函数计算杆长，输入量为动静铰接点坐标，远心点、末端点坐标，杆长
                                                             %输出量为驱动杆杆长
           
function [l_mark]=comput(ss,mm,fix,l,tx,ty,tz)                               %内置计算函数，输入动静铰接点坐标，远心点、末端点坐标，输出杆长数据
    %-----------------------------------------------------------------------------------------
    %变量数组初始化
    l_mark=zeros(1,6);                                                       %驱动杆杆长数组初始化
    sm=zeros(6,4);                                                           %动铰接点坐标（静坐标系下）数组初始化
    smd=zeros(6,3);                                                          %驱动杆方向向量数组初始化
    %-----------------------------------------------------------------------------------------
    %-----------------------------------------------------------------------------------------
    %欧拉角相关计算
    t=[tx,ty,tz];                                                            %末端坐标赋值
    D=[t(1)-fix(1),t(2)-fix(2),t(3)-fix(3)];                                 %求器械杆上静坐标系下，从远心点到末端点的方向向量,即动坐标系Z轴在静坐标系下的方向向量
    rtf=norm(D);                                                             %方向向量的模长，便于计算
    k=rtf/l;                                                                 %向量比值,其含义参见计算文档1.3节公式（5）
    mo=[t(1)-(t(1)-fix(1))/k,t(2)-(t(2)-fix(2))/k,t(3)-(t(3)-fix(3))/k];     %计算动静平台位置变换量，即任意时刻动坐标系原点在静坐标系下的坐标
    euler_y=asin(D(1)/rtf);                                                  %求欧拉角中，第二次绕动坐标系y轴的转动角度，欧拉角的定义请参见计算文档1.4节
    euler_x=asin(-D(2)/(rtf*cos(euler_y)));                                  %求欧拉角中，第一次绕动（或静）坐标系x轴的转动角度
    %-----------------------------------------------------------------------------------------
    %------------------------------------------------------------------------------------------
    %求转换矩阵及杆长数据
    Tms=[                                                                    %从静坐标系变换到动坐标系下的转换矩阵,参见计算文档1.4节公式（11）
        cos(euler_y)              ,0           ,sin(euler_y)              ,mo(1);
        sin(euler_y)*sin(euler_x) ,cos(euler_x),-sin(euler_x)*cos(euler_y),mo(2);
        -cos(euler_x)*sin(euler_y),sin(euler_x),cos(euler_y)*cos(euler_x) ,mo(3);
        0                         ,0           , 0                        ,1
    ];
     for i=(1:1:6)                                                          %杆序循环，依次计算第一杆到第六杆
         sm(i,:)=(Tms*mm(i,:)')';                                           %计算动铰接点在静坐标系下的坐标
         smd(i,:)=[sm(i,1)-ss(i,1),sm(i,2)-ss(i,2),sm(i,3)-ss(i,3)];        %计算驱动杆在静坐标系下的方向向量
         l_mark(i)=norm(smd(i,:));                                          %求第i驱动杆杆杆长
     end
    %----------------------------------------------------------------------------------------------
end
end